/******************************************************************************

                  版权所有 (C), 2011-2022, 华为技术有限公司

******************************************************************************
  文 件 名   : huawei_proc.h
  版 本 号   :
  作    者   : 
  生成日期   : 
  最近修改   :
  功能描述   : 
  函数列表   :

  修改历史   :
  日    期   :
  作    者   :
  修改内容   :
<问题单号>     <作  者>    <修改时间>   <版本> <修改描述>
******************************************************************************/

#include <linux/module.h>
#include <linux/proc_fs.h>
#include <asm/uaccess.h>

int wifiproc_init(void);
void wifiproc_exit(void);
