/**************************************************************************
  头文件包含                            
**************************************************************************/
#include "BSP.h"

/**************************************************************************
  宏定义
**************************************************************************/
#define PMU_CTRL_TIME_OUT (60*1000)
#define PMU_SYNC_TIME_OUT 10000

/**************************************************************************
  枚举定义
**************************************************************************/

/* 控制源类型 */
typedef enum _tagePmuCtrlSrType
{
    E_PMU_CTRL_SR_TYPE_LDO = 0,
    E_PMU_CTRL_SR_TYPE_BUCK,
    E_PMU_CTRL_SR_TYPE_DR,
    E_PMU_CTRL_SR_TYPE_BOTTOM
}ePmuCtrlSrType;
/* 操作类型 */
typedef enum _tagePmuCtrlType
{
    E_PMU_CTRL_TYPE_VOL_CUR_SET= 0,
    E_PMU_CTRL_TYPE_ONOFF,
    E_PMU_CTRL_TYPE_VOL_CUR_GET,
    E_PMU_CTRL_TYPE_BOTTOM
}ePmuCtrlType;

typedef struct _tagStPmuCtrl
{
    ePmuCtrlSrType  eSrType;
    ePmuCtrlType    eCtrlType;
    BSP_U32         id;         /* LDO/BUCK/DR号 */
    union 
    {
        BSP_U32 value;  /* 电压或电流值 */
        BSP_BOOL bOn;   /* 是否打开 */
    }param;
}stPmuCtrl;
/*****************************************************************************
* 函 数 名  : BSP_PMU_DRCtrl
*
* 功能描述  : 调用M核的函数打开DR
*
* 输入参数  : id,DR号，从0开始;
*             bOn,打开或关闭
* 输出参数  : 
*
* 返 回 值  : 
*
* 其它说明  : 
*
*****************************************************************************/
BSP_S32 BSP_PMU_DRCtrl(BSP_U32 id, BSP_BOOL bOn);
/*******************************************************************************
  Function:     BSP_PMU_DrCurrentSet
  Description:  用于设置各路电流源的输出电流

  Input:        Vs_ID: PMU电流源编号，取值范围由PMU_ISRC定义：
                          DR1~DR3；
                ImA:      目标电流值（单位:mA），取值范围：
                          3mA,6mA,9mA,12mA,15mA,18mA,21mA,24mA
  Output:
  Return:       BSP_OK:    操作成功
                BSP_ERROR: 操作失败
  Others:
*******************************************************************************/
BSP_S32 BSP_PMU_DrCurrentSet(BSP_U32 id, BSP_U16 value);
/*******************************************************************************
  Function:     BSP_PMU_DrCurrentGet
  Description:  用于查询各路电流源的输出电流

  Input:        id: PMU电流源编号，取值范围 DR1~DR3 (0~2)
  Output:
  Return:       查询电流源的输出电流值（单位:mA）
                为负值（ERROR）表示查询失败
  Others:
*******************************************************************************/
BSP_S32 BSP_PMU_DrCurrentGet(BSP_U32 id);

/*****************************************************************************
* 函 数 名  : BSP_PMU_LDOCtrl
*
* 功能描述  : 调用M核的函数打开LDO
*
* 输入参数  : 
* 输出参数  : 
*
* 返 回 值  : 
*
* 其它说明  : 
*
*****************************************************************************/
BSP_S32 BSP_PMU_LDOCtrl(BSP_U32 id, BSP_BOOL bOn);

/*****************************************************************************
* 函 数 名  : BSP_PMU_LDOVoltSet
*
* 功能描述  : 调用M核的函数设置LDO电压 
*
* 输入参数  : 
* 输出参数  : 
*
* 返 回 值  : 
*
* 其它说明  : 
*
*****************************************************************************/
BSP_S32 BSP_PMU_LDOVoltSet(BSP_U32 id, BSP_U16 value);
/*****************************************************************************
* 函 数 名  : BSP_PMU_LDOVoltGet
*
* 功能描述  : 获取LDO通道的电压值
*
* 输入参数  : LdoID，LDO通道
*             pusVoltValue，电压值指针，
* 输出参数  : 
*
* 返 回 值  : 电压值,等于实际电压乘以100
*               -1,错误
*
* 其它说明  : 
*
*****************************************************************************/
BSP_S32 BSP_PMU_LDOVoltGet(BSP_U8 ucLDO);
/*****************************************************************************
* 函 数 名  : BSP_PMU_BuckCtrl
*
* 功能描述  : 调用M核的函数打开Buck
*
* 输入参数  : BuckID,Buck号，从1开始;
*             bOpen,打开或关闭
* 输出参数  : 
*
* 返 回 值  : 
*
* 其它说明  : 
*
*****************************************************************************/
BSP_S32 BSP_PMU_BuckCtrl(BSP_U32 id, BSP_BOOL bOn);
/*****************************************************************************
* 函 数 名  : BSP_PMU_LDOVoltSet
*
* 功能描述  : 调用M核的函数设置Buck电压 
*
* 输入参数  : 
* 输出参数  : 
*
* 返 回 值  : 
*
* 其它说明  : 
*
*****************************************************************************/
BSP_S32 BSP_PMU_BuckVoltSet(BSP_U32 id, BSP_U16 value);
/*****************************************************************************
* 函 数 名  : BSP_PMU_BuckVoltGet
*
* 功能描述  : 设置PMU BUCK电压输出值
*
* 输入参数  : buckID，BUCK通道
*
* 输出参数  : 
*
* 返 回 值  : 
* 返 回 值  : 电压值,等于实际电压乘以100
*               -1,错误
*
* 其它说明  : 
*
*****************************************************************************/
BSP_S32 BSP_PMU_BuckVoltGet(BSP_U8 buckID);

