/*************************************************************************
*   版权所有(C) 2008-2012, 深圳华为技术有限公司.
*
*   文 件 名 :  BSP_ONOFF.h
*
*   作    者 :  z67193
*
*   描    述 :  BSP类型定义头文件
*
*   修改记录 :  2012年04月14日  v1.00  z67193  创建
*************************************************************************/

#ifndef	__BSP_ONOFF_H__
#define __BSP_ONOFF_H__

#ifdef __cplusplus
extern "C" 
{
#endif /* __cplusplus */


/* 开机模式定义 */
typedef enum DRV_START_MODE_tag
{
    DRV_START_MODE_EXCEPTION,  /* 异常开机模式，此时大部分业务都不启动, 仅提示信息 */
    DRV_START_MODE_CHARGING,   /* 充电开机模式, ps 等业务不启动  */
    DRV_START_MODE_NORMAL,     /* 正常开机模式，所有业务启动     */    
    DRV_START_MODE_BUTT
}DRV_START_MODE_ENUM;


/************************************************************************************
 *Function Name :  drv_start_mode_get   
 *Description   :  获取本次开机的模式，参见 DRV_START_MODE_ENUM 定义
 *Others        :  No
************************************************************************************/
DRV_START_MODE_ENUM drvStartModeGet( void );


/************************************************************************************
 *Function Name :  drvShutdown   
 *Description   :  关闭系统(发送消息告知关机模块后立刻返回，实际关机由关机模块处理)
 *Others        :  No
************************************************************************************/


/************************************************************************************
 *Function Name :  drvPowerOff   
 *Description   :  直接下电
 *Others        :  No
************************************************************************************/
void drvPowerOff( void );


/************************************************************************************
 *Function Name :  drvReboot(
 *Description   :  热复位(通过系统控制器的复位实现，不调电)
 *Others        :  No
************************************************************************************/
void drvReboot( void );

/*****************************************************************************
 函 数 名  : BSP_ONOFF_DrvPowerOff
 功能描述  : 单板直接下电
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
*****************************************************************************/
extern void BSP_ONOFF_DrvPowerOff(void);




#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif    /* End #define __BSP_ONOFF_H__ */


